/*
What is the Big O notation for Function findStudentById . Explain your reason.
Answer: 

o(n) ฟังชั่นนี้ให้หาข้อมูลของนักเรียน ใน[] โดยเชคจากid ถ้าพบid  โดยจะทำการค้นหาทุกข้อมูลใน[]จนกว่าจะเจอ ถ้าพบid ที่ต้องการให้ส่งข้อมูลของstudents  มาทั้งชุด ถ้าไม่พบก็ return nullออกมา


*/

/* 
What is the Big O notation for Function findProductPrice. Explain your reason.
Answer:
o log(n) ข้อนี้จะแบ่งข้อมูลในการค้นหา โดยแบ่งเป็นฝั่งซ้ายและขวาของขนาดข้อมูล ทำให้เวลาการค้นหาเร็วกว่าข้อแรก ใช้การค้นหาข้อมูลด้วยชื่อ และให้แสดงผล ของราคาออกมาเมื่อค้นหาพบ ในกรณที่ไม่เข้าลูปใดเลยในการค้นหา ให้return -1


*/

/* 
Which function is more efficient and why?
Answer:

ผมเลือก binary Search ในข้อสอง ทำงานได้ไวและมีปะสิทธิภาพมากกว่า เนื่องจากมีการแบ่งข้อมูลเปนสองก้อน และค้นหาไปพร้อมกัน แสดงว่า ขนาดของข้อมูลยิ่งเล็กลงในแต่ล่ะก้อน การค้นก็ก็ยิ่งเร็วขึ้น แม้จะไม่ได้มีการจัดเรียงข้อมูลก้ตาม แต่ถ้าข้อมูลมีการจัดเรียงมาแล้ว การใช้bi search ก็ยิ่งมีประสิทธิภาพเพิ่มมากขึ้น



*/
